# Creating DataFrames

### Creating a series object

In [1]:
import pandas as pd
import numpy as np
import warnings
warnings.filterwarnings('ignore')

In [2]:
list_A =['Arjun','Anoop','Sanu']

In [3]:
series_from_list_A = pd.Series(list_A)

In [4]:
series_from_list_A

0    Arjun
1    Anoop
2     Sanu
dtype: object

In [5]:
type(series_from_list_A)

pandas.core.series.Series

#### creating DataFrame

In [6]:
data_from_list_A = pd.DataFrame(list_A)

In [7]:
data_from_list_A

       0
0  Arjun
1  Anoop
2   Sanu

In [8]:
type(data_from_list_A)

pandas.core.frame.DataFrame

In [9]:
data_from_list_A = pd.DataFrame(list_A, columns=['Names'])

In [10]:
data_from_list_A

   Names
0  Arjun
1  Anoop
2   Sanu

#### Creating Multiple columns

In [11]:
list_B = [90,92,94]

In [12]:
data_from_list_AB = pd.DataFrame(list(zip(list_A,list_B)),columns =['Names','Marks'])

In [13]:
data_from_list_AB

   Names  Marks
0  Arjun     90
1  Anoop     92
2   Sanu     94

### creating DataFrame from list of Dictionaries

In [15]:
dict_list = [
    {'Names':'Arjun' , 'Marks':90},
    {'Names':'Anoop' , 'Marks':92},
    {'Names':'Sanu' , 'Marks':94}
]

In [16]:
data_from_dict_list = pd.DataFrame(dict_list)

In [17]:
data_from_dict_list

   Names  Marks
0  Arjun     90
1  Anoop     92
2   Sanu     94

### Concatenating Series Objects

In [18]:
Series_1 = pd.Series(['A','B','C'])

In [19]:
Series_2 = pd.Series(['D','E','F'])

In [20]:
Series_1

0    A
1    B
2    C
dtype: object

In [21]:
Series_2

0    D
1    E
2    F
dtype: object

In [22]:
pd.concat([Series_1,Series_2])

0    A
1    B
2    C
0    D
1    E
2    F
dtype: object

In [23]:
pd.concat([Series_1,Series_2], ignore_index =True)

0    A
1    B
2    C
3    D
4    E
5    F
dtype: object

### Concatenating DataFrames

In [24]:
Arjun_scores = {
"subjects" :['maths','physics','chemistry','biology'],
"sem1" :[70,75,80,85],
"sem2" :[80,85,90,95],
}
Sanu_scores = {
"subjects" : ['maths','physics','chemistry','computer'],
"sem1" :[80,82,84,86],
"sem2" :[89,91,93,95],
}

In [25]:
data_Arjun = pd.DataFrame(Arjun_scores)

In [26]:
data_Sanu = pd.DataFrame(Sanu_scores)

In [27]:
data_Arjun

    subjects  sem1  sem2
0      maths    70    80
1    physics    75    85
2  chemistry    80    90
3    biology    85    95

In [28]:
data_Sanu

    subjects  sem1  sem2
0      maths    80    89
1    physics    82    91
2  chemistry    84    93
3   computer    86    95

In [29]:
data_concat = pd.concat([data_Arjun,data_Sanu])

In [30]:
data_concat

    subjects  sem1  sem2
0      maths    70    80
1    physics    75    85
2  chemistry    80    90
3    biology    85    95
0      maths    80    89
1    physics    82    91
2  chemistry    84    93
3   computer    86    95

In [31]:
data_concat = pd.concat([data_Arjun,data_Sanu],ignore_index=True)
data_concat

    subjects  sem1  sem2
0      maths    70    80
1    physics    75    85
2  chemistry    80    90
3    biology    85    95
4      maths    80    89
5    physics    82    91
6  chemistry    84    93
7   computer    86    95

In [32]:
data_concat = pd.concat([data_Arjun,data_Sanu],keys=['Arjun','Sanu'])
data_concat

          subjects  sem1  sem2
Arjun 0      maths    70    80
      1    physics    75    85
      2  chemistry    80    90
      3    biology    85    95
Sanu  0      maths    80    89
      1    physics    82    91
      2  chemistry    84    93
      3   computer    86    95

In [33]:
data_concat.loc['Arjun']

    subjects  sem1  sem2
0      maths    70    80
1    physics    75    85
2  chemistry    80    90
3    biology    85    95

In [34]:
data_concat.loc['Sanu']

    subjects  sem1  sem2
0      maths    80    89
1    physics    82    91
2  chemistry    84    93
3   computer    86    95

### Merging Dataframes

In [35]:
data_merged = pd.merge(data_Arjun,data_Sanu,on='subjects')
data_merged

    subjects  sem1_x  sem2_x  sem1_y  sem2_y
0      maths      70      80      80      89
1    physics      75      85      82      91
2  chemistry      80      90      84      93

In [36]:
data_merged = pd.merge(data_Arjun,data_Sanu,how='outer',on='subjects')
data_merged

    subjects  sem1_x  sem2_x  sem1_y  sem2_y
0      maths    70.0    80.0    80.0    89.0
1    physics    75.0    85.0    82.0    91.0
2  chemistry    80.0    90.0    84.0    93.0
3    biology    85.0    95.0     NaN     NaN
4   computer     NaN     NaN    86.0    95.0

In [37]:
data_merged = pd.merge(data_Arjun,data_Sanu,how='outer',on='subjects',suffixes=['Arjun','Sanu'])
data_merged

    subjects  sem1Arjun  sem2Arjun  sem1Sanu  sem2Sanu
0      maths       70.0       80.0      80.0      89.0
1    physics       75.0       85.0      82.0      91.0
2  chemistry       80.0       90.0      84.0      93.0
3    biology       85.0       95.0       NaN       NaN
4   computer        NaN        NaN      86.0      95.0